import { StyleSheet, View, Text, Image, ScrollView } from "react-native";
import { SafeAreaView } from "react-native-safe-area-context";

const City = () => {
  return (
    <SafeAreaView style={{ flex: 1 }}>
      <ScrollView style={styles.container}>
        <Text style={styles.title}>My city</Text>
        <Image
          source={{
            uri: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTjs21p59DoKjazAbAA6aKrX0iECO4zBVrwVjwLKR1pBw&s=10",
          }}
          style={{ width: 300, height: 200 }}
          resizeMode="cover"
        />
        <Image
          source={{
            uri: "https://i.pinimg.com/736x/93/0e/89/930e8985e9595216382151f0e2cf13c0.jpg",
          }}
          style={{ width: 100, height: 100 }}
        />

        <Text>
          Запорі́жжя (МФА: [zɑpoˈriʒʲːɐ] ( прослухати); до 1921 року —
          Олекса́ндрівськ) — місто в Україні, обласний центр Запорізької області,
          адміністративний центр Запорізького району та Запорізької міської
          громади. За чисельністю населення — 6-те місто в Україні — 710 052
          осіб станом на 1 січня 2022 року[4] (але близько ▼ 700 тисяч осіб
          станом на лютий 2026)[5]. Розташоване на головній воднотранспортній
          магістралі України — річці Дніпро, у місці її перетину
          транспортно-комунікаційними коридорами, що сполучають Південну Україну
          з її столицею, західними, центральними областями та Донбас із
          Криворіжжям. Разом із навколишніми поселеннями утворює Запорізьку
          агломерацію. Є одним з найбільших адміністративних, індустріальних та
          культурних центрів Півдня України з розвиненим машинобудуванням,
          чорною та кольоровою металургією, хімічною та будівельною
          промисловістю, річковим портом і важливим транзитним залізничним
          вузлом. Відповідно до Генеральної схеми планування території України,
          Запоріжжя займає важливе місце в регіональній системі розселення і
          виконує функції обласного, міжнародного і районного центрів, кожний з
          яких має свою зону міжселищного обслуговування. Отож, у зоні впливу
          Запоріжжя як обласного центра на території 2690 тис. га розташовано 14
          міст, 23 селища, значна кількість сіл, в яких мешкає понад 2 млн осіб.
          Очолювана Запоріжжям міжрайонна система розселення (приміська зона),
          вирізняється високим рівнем виробничо-господарського опанування
          території, високою цінністю сільськогосподарських земель і середовища.
          Приміська зона охоплює Запорізький, Василівський та Пологівський район
          (у тому числі до 19 липня 2020 року — ліквідовані колишні
          Вільнянський, Новомиколаївський, Оріхівський, Кам'янсько-Дніпровський
          адміністративні райони Запорізької області), загальною площею 760 тис.
          га, на якій розташовано 5 міст, 6 селищ та близько 300 сільських
          населених пунктів. Загальна чисельність населення приміської зони —
          приблизно 315 тис. осіб. Особливістю міста Запоріжжя є те, що в ньому
          зосереджено приблизно 65 % продуктивних потужностей області й 43 %
          населення області. З 24 лютого 2022 року, в ході повномасштабного
          російського вторгнення в Україну, російські окупанти регулярно
          завдають обстріли по інфраструктурі та житловим будівлям міста
          Запоріжжя. Назва До 15 березня 1921 року місто називалося
          Олександрівськ за назвою Олександрівської фортеці, закладеної у 1770
          році. Однозначної думки, на честь кого було названо фортецю, немає.
          Називаються імена генерал-фельдмаршала Олександра Голіцина, князя
          Олександра Вяземського[6][7]. 15 березня 1921 року Запорізьким
          губернським виконавчим комітетом виданий наказ про перейменування
          міста Олександрівська в Запоріжжя — тобто розташоване за Дніпровими
          порогами[8]. Нова назва й раніше була відомою серед населення та
          враховувала історичні традиції краю — міста за порогами, до
          спорудження у 1932 році греблі Дніпровської ГЕС в місці, де річка
          Дніпро перетинає скелястий південний край Українського щита,
          закінчувалися численні Дніпрові пороги, що перешкоджали
          судноплавству[9]. З 15 березня 1921 року у місцевій пресі
          зустрічаються обидві назви — Запоріжжя та Олександрівськ. Проте
          залізничні станції міста до 1934 року зберігали свої назви
          Олександрівськ І та Олександрівськ II. 27 червня 2023 року Національна
          комісія зі стандартів державної мови рекомендувала розглянути
          перейменування міста Запоріжжя, проте міська влада повинна довести
          доцільність назви обласного центру. На думку комісії зі стандартів
          державної мови, назва Запоріжжя «може стосуватися російської
          імперської політики». Фахівці-філологи та історики з усіх регіонів
          України склали перелік з 1400 міст та сіл, які запропоновано
          перейменувати на виконання закону «Про засудження та заборону
          пропаганди російської імперської політики в Україні і деколонізацію
          топонімії», серед них і місто Запоріжжя. Комісія рекомендувала
          обґрунтувати доцільність збереження поточної назви або запропонувати
          нову назву, проте комісія ніяк не пояснила, чому Запоріжжя відповідає
          або не відповідає новому законодавству. Тож Запорізька міська рада
          мала 6 місяців аби довести доцільність назви обласного центру або
          запропонувати свою назву. Якщо впродовж шести місяців місцева влада не
          виконає рекомендації, то Верховна Рада України мала право змінити
          назву міста за рішенням Національної комісії зі стандартів державної
          мови[10][11]. 30 червня 2023 року Національна комісія зі стандартів
          державної мови скасувала ідею зміни назви обласного центру, а назва
          міста залишилася незмінною. Із пояснень фахівців стало відомо, що вони
          просто хотіли діалогу між місцевою владою, філологами та
          краєзнавцями[12].
        </Text>
      </ScrollView>
    </SafeAreaView>
  );
};

const styles = StyleSheet.create({
  container: {
    padding: 20,  
  },
  title: {
    fontSize: 40,
    color: "#148194",
    fontWeight: "bold",
    fontFamily: "monospace",
  },
});

export default City;
